mongpt/stm32-st7789_V2/examples/stm32l432/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define ENT_Pin GPIO_PIN_14
#define ENT_GPIO_Port GPIOC
#define ENT_EXTI_IRQn EXTI15_10_IRQn
#define RGT_Pin GPIO_PIN_15
#define RGT_GPIO_Port GPIOC
#define RGT_EXTI_IRQn EXTI15_10_IRQn
#define LFT_Pin GPIO_PIN_0
#define LFT_GPIO_Port GPIOA
#define LFT_EXTI_IRQn EXTI0_IRQn
#define BCK_Pin GPIO_PIN_1
#define BCK_GPIO_Port GPIOA
#define BCK_EXTI_IRQn EXTI1_IRQn
#define TFT_BL_Pin GPIO_PIN_15
#define TFT_BL_GPIO_Port GPIOA
#define TFT_SCK_Pin GPIO_PIN_3
#define TFT_SCK_GPIO_Port GPIOB
#define TFT_CS_Pin GPIO_PIN_4
#define TFT_CS_GPIO_Port GPIOB
#define TFT_MOSI_Pin GPIO_PIN_5
#define TFT_MOSI_GPIO_Port GPIOB
#define TFT_DC_Pin GPIO_PIN_6
#define TFT_DC_GPIO_Port GPIOB
#define TFT_RST_Pin GPIO_PIN_7
#define TFT_RST_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
